OpenFOAM-2.3.0/tutorials/multiphase/interFoam/ras/damBreakPorousBaffle/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    leftWall
    {
        type            wall;
        nFaces          50;
        startFace       4419;
    }
    rightWall
    {
        type            wall;
        nFaces          50;
        startFace       4469;
    }
    lowerWall
    {
        type            wall;
        nFaces          62;
        startFace       4519;
    }
    atmosphere
    {
        type            patch;
        nFaces          46;
        startFace       4581;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          4536;
        startFace       4627;
    }
    porous_half0
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          13;
        startFace       9163;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  porous_half1;
    }
    porous_half1
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          13;
        startFace       9176;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  porous_half0;
    }
)

// ************************************************************************* //
